import { Box, Typography } from '@mui/material'
import style from './style.module.scss'

function PolicyBox() {
  return (
    <Box className={`page-agreement ${style.agreement} py-24 text-white`}>
      <Typography variant="h4">Политика в отношении обработки персональных данных</Typography>
      <br />
      <Typography variant="body2">
        Защита персональных данных – один из ключевых приоритетов нашей деятельности.
      </Typography>
      <Typography variant="body2">
        Политика разработана в целях реализации требований законодательства в области обработки и обеспечения
        безопасности персональных данных и направлена на обеспечение защиты прав и свобод гражданина, использующего
        сайт, при обработке его персональных данных.
      </Typography>

      <Typography variant="body2">
        Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) действует в
        отношении всей информации, которую сайт, расположенный на доменном имени https://tvoepravo.online, может
        получить о Пользователе во время его использования.
      </Typography>

      <Typography variant="body2">
        Используя Сайт Пользователь подтверждает согласие с настоящей Политикой конфиденциальности.
      </Typography>

      <Typography variant="body2">
        В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование Сайта.
      </Typography>
      <Typography variant="body2">
        Настоящая Политика конфиденциальности применяется только к сайту по адресу: https://tvoepravo.online.
        Администрация сайта не контролирует и не несет ответственность за сайты третьих лиц, на которые Пользователь
        может перейти по ссылкам, доступным на сайте по адресу: https://tvoepravo.online.
      </Typography>
      <Typography variant="body2">
        Администрация не проверяет достоверность персональных данных, предоставляемых Пользователями.
      </Typography>
      <br />
      <Typography variant="h5">1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ</Typography>
      <br />
      <Typography variant="body2">В настоящей Политике конфиденциальности применяются следующие термины:</Typography>
      <Typography variant="body2">
        Администрация сайта по адресу: https://tvoepravo.online (далее – Администрация) – уполномоченные сотрудники на
        управление Сайтом, действующие от имени Правообладателя Сайта - АНО «ТВОЕ ПРАВО».
      </Typography>
      <Typography variant="body2">
        Оператор персональных данных – АНО «ТВОЕ ПРАВО» (ИНН 6500017204, электронная почта: ovik_arustamyan@mail.ru) и
        (или) его партнеры, которые используют данный сайт в своей деятельности и, организуют, и (или) осуществляет
        обработку персональных данных, а также определяют цели обработки персональных данных, состав персональных
        данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.
      </Typography>
      <Typography variant="body2">
        Персональные данные - любая информация, относящаяся к прямо или косвенно к определенному или определяемому
        Пользователю (субъекту персональных данных).
      </Typography>
      <Typography variant="body2">
        Персональные данные, разрешенные субъектом персональных данных для распространения – сведения о субъекте, доступ
        к которым субъект предоставил неограниченному кругу лиц путем дачи согласия на обработку этих персональных
        данных, разрешенных им для распространения в порядке, предусмотренном законодательством.
      </Typography>
      <Typography variant="body2">
        Обработка персональных данных - любое действие (операция) или совокупность действий (операций), совершаемых с
        использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор,
        запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование,
        передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение
        персональных данных.
      </Typography>
      <Typography variant="body2">
        Конфиденциальность персональных данных - обязательное для соблюдения Оператором или иным получившим доступ к
        персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных
        или наличия иного законного основания.
      </Typography>
      <Typography variant="body2">
        Пользователь Сайта – любое лицо, использующее сайт, по адресу: https://tvoepravo.online.
      </Typography>
      <Typography variant="body2">
        Cookies — небольшой фрагмент данных, отправленный веб-сервером и хранимый на компьютере пользователя, который
        веб-клиент или веб-браузер каждый раз пересылает веб-серверу в HTTP-запросе при попытке открыть страницу
        соответствующего сайта.
      </Typography>
      <Typography variant="body2">
        IP-адрес — уникальный сетевой адрес узла в компьютерной сети, построенной по протоколу IP.
      </Typography>
      <Typography variant="body2">
        Автоматизированная обработка персональных данных – обработка персональных данных с помощью средств
        вычислительной техники.
      </Typography>
      <Typography variant="body2">
        Предоставление персональных данных – действия, направленные на раскрытие персональных данных определенному лицу
        или неопределенному кругу лиц.
      </Typography>
      <Typography variant="body2">
        Уничтожение персональных данных – действия, в результате которых становится невозможным восстановить содержание
        персональных данных в информационной системе персональных данных и (или) в результате которых уничтожаются
        материальные носители персональных данных.
      </Typography>
      <Typography variant="body2">
        Обезличивание персональных данных – действия, в результате которых становится невозможным без использования
        дополнительной информации определить принадлежность персональных данных конкретному субъекту персональных
        данных.
      </Typography>
      <Typography variant="body2">
        Трансграничная передача персональных данных – передача персональных данных на территорию иностранного
        государства органу власти иностранного государства, иностранному физическому лицу или иностранному юридическому
        лицу.
      </Typography>
      <br />
      <Typography variant="h5">2. ПРЕДМЕТ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ</Typography>
      <br />
      <Typography variant="body2">
        1. Настоящая Политика конфиденциальности устанавливает обязательства Администрации сайта по обеспечению режима
        защиты конфиденциальности персональных данных, которые получает от Пользователей при использовании Сайта.
      </Typography>
      <Typography variant="body2">
        2. Оператор обрабатывает персональные данные, которые поступили от Пользователя при регистрации в личном
        кабинете, заполнения заявки для получения услуги или сотрудничества, а также при звонке по номерам, указанным на
        сайте. Пользователь самостоятельно и по своей воле предоставляет персональные данные Оператору.
      </Typography>
      <Typography variant="body2">
        3. Оператор обрабатывает обезличенные персональные данные Пользователей, только в случае, если имеется
        разрешение в настройках браузера Пользователя.
      </Typography>
      <Typography variant="body2">
        4. Отключение cookies может повлечь невозможность доступа к частям Сайта, требующим авторизации.
      </Typography>
      <Typography variant="body2">
        5. Администрация сайта осуществляет сбор статистики об IP-адресах своих Пользователей только в случае оставления
        заявки для оказания услуги.
      </Typography>
      <br />
      <Typography variant="h5">3. ЦЕЛИ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ ПОЛЬЗОВАТЕЛЕЙ</Typography>
      <br />
      <Typography variant="body2">
        Администрация сайта обрабатывает персональные данные Пользователя в следующих целях:
      </Typography>
      <Typography variant="body2">
        - идентификации Пользователя, при регистрации на сайте, а также идентификация в рамках соглашений и договоров,
        предоставления Пользователю персональных услуг на сайте, обработки и получения платежей;
      </Typography>
      <Typography variant="body2">
        - установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся
        использования сайта, обработки запросов и заявок от Пользователя, информирования Пользователя об услугах и
        контроля качества оказанных услуг, в том числе общение в чате и личном кабинете;
      </Typography>
      <Typography variant="body2">
        - представления Пользователю эффективной клиентской и технической поддержки при возникновении проблем, связанных
        с использованием сайта;
      </Typography>
      <Typography variant="body2">- предоставления доступа Пользователю на сайты или сервисы партнеров;</Typography>
      <Typography variant="body2">
        - показа для Пользователя рекламы, таргетирования рекламных материалов по географическим критериям, интересам и
        другим параметрам.
      </Typography>
      <br />
      <Typography variant="h5">4. УСЛОВИЯ И СРОКИ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</Typography>
      <br />
      <Typography variant="body2">
        1. При обработке персональных данных Пользователей Администрация руководствуется Федеральным законом РФ «О
        персональных данных».
      </Typography>
      <Typography variant="body2">
        2. Обработка персональных данных Пользователя осуществляется любым законным способом с использованием средств
        автоматизации или без использования таких средств.
      </Typography>
      <Typography variant="body2">
        3. Оператор обрабатывает следующие персональные данные Пользователя: фамилию, имя, отчество, паспортные данные,
        телефон, адрес электронной почты, почтовый адрес, банковские реквизиты, пол, возраст, фото-видео изображение и
        иные данные, которые Пользователь предоставит самостоятельно.
      </Typography>

      <Typography variant="body2">
        4. Персональный данные Пользователей сайта, которые собираются платежными Сервисами или третьими лицам,
        обрабатываются в соответствии с их политикой конфиденциальности и иными их разработанными документами.
        Пользователь обязан самостоятельно с ними ознакомиться.
      </Typography>

      <Typography variant="body2">5. Обработка специальных категорий персональных данных не осуществляется.</Typography>
      <Typography variant="body2">
        6. Администрация сайта предпринимает все разумные технические и организационные меры для защиты информации,
        предоставляемой Пользователями, от неправомерного или случайного доступа к ней, от уничтожения, изменения,
        блокирования, копирования, распространения, а также от иных неправомерных действий с ней третьих лиц.
      </Typography>
      <Typography variant="body2">
        7. Пользователи понимают и соглашаются, что Администрация не может предоставить гарантии абсолютной защиты,
        предоставляемой Пользователями информации и гарантии абсолютной безопасности коммуникаций между Пользователями и
        Сайтом.
      </Typography>
      <Typography variant="body2">
        8. В отношении персональной информации Пользователя сохраняется ее конфиденциальность, кроме случаев
        добровольного предоставления Пользователем информации о себе для общего доступа кругу лиц, на основании
        Федерального закона РФ «О персональных данных»:
      </Typography>
      <Typography variant="body2">
        8.1 Согласие на обработку персональных данных, разрешенных субъектом персональных данных для распространения,
        Пользователь предоставляет путем принятия оферты согласия на сайте. При действиях, указанных в п. 2 Раздела 2
        данный Пользователь соглашается, что дает такое согласие.
      </Typography>
      <Typography variant="body2">
        8.2. В согласии на обработку персональных данных, разрешенных субъектом персональных данных для распространения,
        субъект персональных данных вправе установить запреты на передачу (кроме предоставления доступа) этих
        персональных данных оператором неограниченному кругу лиц, а также запреты на обработку или условия обработки
        (кроме получения доступа) этих персональных данных неограниченным кругом лиц и сообщить оператору дополнительно.
      </Typography>
      <Typography variant="body2">
        8.3. Оператор обязан в срок не позднее трех рабочих дней с момента получения соответствующего согласия субъекта
        персональных данных опубликовать информацию об условиях обработки и о наличии запретов и условий на обработку
        неограниченным кругом лиц персональных данных, разрешенных субъектом персональных данных для распространения.
      </Typography>
      <Typography variant="body2">
        8.4. Передача персональных данных, разрешенных субъектом персональных данных для распространения, должна быть
        прекращена в любое время по требованию субъекта персональных данных. Данное требование должно включать в себя
        фамилию, имя, отчество (при наличии), контактную информацию (номер телефона, адрес электронной почты или
        почтовый адрес) субъекта персональных данных, а также перечень персональных данных, обработка которых подлежит
        прекращению.
      </Typography>
      <Typography variant="body2">
        8.5. Действие согласия субъекта персональных данных на обработку персональных данных, разрешенных субъектом
        персональных данных для распространения, прекращается с момента поступления оператору требования
      </Typography>
      <Typography variant="body2">
        8.6. Субъект персональных данных вправе обратиться с требованием прекратить передачу своих персональных данных,
        ранее разрешенных субъектом персональных данных для распространения, к любому лицу, обрабатывающему его
        персональные данные. Данное лицо обязано прекратить передачу персональных данных в течение трех рабочих дней с
        момента получения требования субъекта персональных данных.
      </Typography>
      <Typography variant="body2">
        9. Персональные данные Пользователя могут быть переданы уполномоченным органам государственной власти Российской
        Федерации и третьим лицам, только по основаниям и в порядке, установленным законодательством Российской
        Федерации.
      </Typography>
      <Typography variant="body2">
        10. Осуществляется хранение персональных данных субъектов данных не дольше, чем того требуют цели обработки
        персональных данных. Срок хранения персональных данных может быть установлен законом или предусмотрен согласием,
        предоставляемым субъектом персональных данных. После истечения сроков хранения персональные данные подлежат
        уничтожению или обезличиванию.
      </Typography>
      <Typography variant="body2">11. Трансграничная передача персональных данных не осуществляется.</Typography>
      <br />
      <Typography variant="h5">5. ОТЗЫВ И УНИЧТОЖЕНИЕ ПЕРСОНАЛЬНЫХ ДАННЫХ</Typography>
      <br />
      <Typography variant="body2">
        1. Субъект данных имеет право в любой момент отозвать данное им согласие, путем отправки обращения на
        электронный адрес: ovik_arustamyan@mail.ru
      </Typography>
      <Typography variant="body2">
        2. Субъект данных имеет право потребовать исправить свои персональные данные в случае обнаружения неточностей в
        составе персональных данных, которые обрабатываются, в том случае, если не может это сделать самостоятельно,
        путем отправки обращения на электронный адрес: ovik_arustamyan@mail.ru
      </Typography>
      <Typography variant="body2">
        3. Субъект данных имеет право потребовать удалить свои персональные данные путем обращения на электронный адрес:
        ovik_arustamyan@mail.ru
      </Typography>
      <br />
      <Typography variant="h5">6. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</Typography>
      <br />
      <Typography variant="body2">
        1. В случае возникновения вопросов, связанных с обработкой ваших персональных данных или реализации прав
        субъекта персональных данных, пожалуйста, свяжитесь с нами, путем отправки сообщения на адрес электронной почты:
        ovik_arustamyan@mail.ru. Срок ответа на запросы субъектов персональных данных составляет – 1 месяц.
      </Typography>
      <Typography variant="body2">
        2. В случае размещения Пользователем на сайте своего фотоизображения, Пользователь дает разрешение АНО «ТВОЕ
        ПРАВО» и/или Партнерам на использование данного фотоизображения во внутренних и внешних коммуникациях и/или
        коммерческих целях, бессрочно и безвозмездно и обязан предоставить письменное согласие на распространение
        персональных данных, разрешенных к распространению. В случае непредставления такого согласия, Пользователь
        обязан удалить данное фотоизображение.
      </Typography>
      <Typography variant="body2">
        3. Администрация сайта вправе вносить изменения в настоящую Политику конфиденциальности без согласия
        Пользователя. Новая редакция Политики вступает в силу с момента ее размещения на Сайте, если иное не
        предусмотрено новой редакцией Политики.
      </Typography>
      <Typography variant="body2">
        4. Действующая Политика конфиденциальности размещена на странице по адресу https://tvoepravo.online.
      </Typography>
    </Box>
  )
}

export default PolicyBox
