export const fakeLegalServicesJson: Array<Record<string, string>> = [
  {
    content: 'НАЛОГОВЫЕ СПОРЫ, АРБИТРАЖ, БАНКРОТСТВО',
  },
  {
    content: 'ВЗЫСКАНИЕ ДОЛГОВ, ИСПОЛНИТЕЛЬНОЕ ПРОИЗВОДСТВО',
  },
  {
    content: 'ПРЕДСТАВИТЕЛЬСТВО ИНТЕРЕСОВ ОРГАНИЗАЦИЙ И ГРАЖДАН В СУДЕ',
  },
  {
    content: 'ГОСУДАРСТВЕННАЯ РЕГИСТРАЦИЯ ФИРМ, ИП',
  },
  {
    content: 'ЛИКВИДАЦИЯ ЮРИДИЧЕСКИХ ЛИЦ И ИП',
  },
  {
    content: 'ВНЕСЕНИЕ ИЗМЕНЕНИЙ В УЧРЕДИТЕЛЬНЫЕ ДОКУМЕНТЫ',
  },
  {
    content: 'СОСТАВЛЕНИЕ ДОГОВОРОВ, ПРЕТЕНЗИЙ, ЖАЛОБ',
  },
  {
    content: 'СОПРОВОЖДЕНИЕ У НОТАРИУСА, В БАНКАХ, В НАЛОГОВЫХ ОРГАНАХ',
  },
  {
    content: 'ПРОВЕРКА КОНТРАГЕНТОВ',
  },
  {
    content: 'СДЕЛКИ С НЕДВИЖИМОСТЬЮ',
  },
]

export const fakeSecurityServicesJson: Array<Record<string, string>> = [
  {
    content: 'КОМПЛЕКСНОЕ ОБЕСПЕЧЕНИЕ ЭКОНОМИЧЕСКОЙ БЕЗОПАСНОСТИ ПРЕДПРИЯТИЯ',
  },
  {
    content:
      'ОРГАНИЗАЦИЯ ВЗАИМОДЕЙСТВИЯ С ГОСУДАРСТВЕННЫМИ И КОНТРОЛИРУЮЩИМИ СТРУКТУРАМИ ПО РАЗЛИЧНЫМ ВОПРОСАМ ДЕЯТЕЛЬНОСТИ КОМПАНИИ',
  },
]

export const fakeExclusiveServicesJson: Array<Record<string, string>> = [
  {
    content: 'РЕШЕНИЕ СЛОЖНЫХ НАЛОГОВЫХ СПОРОВ',
  },
  {
    content: 'ПРАВОВАЯ ПОМОЩЬ И СОПРОВОЖДЕНИЕ КЛИЕНТОВ В НАЛОГОВЫХ И ПРАВООХРАНИТЕЛЬНЫХ ОРГАНАХ',
  },
]

export const fakeServiceFormatsJson: Array<Record<string, string>> = [
  {
    title: 'Абонентское обслуживание',
    content:
      'Абонентское обслуживание будет необходимым и достаточным фактором для эффективной и стабильной деятельности Вашей организации.',
  },
  {
    title: 'Юридические консультации',
    content:
      'Мы готовы предоставить юридические консультации в максимально удобной форме: письменные правовые заключения, правовые справки в необходимой форме по вопросу применения отдельных положений законодательства, устные консультации наших юристов на интересующую Вас тему.',
  },
]
